---
kind: enumMember
id: F:Autodesk.Revit.DB.SheetDuplicateOption.DuplicateSheetWithViewsAndDetailing
enum: Autodesk.Revit.DB.SheetDuplicateOption
source: html/0d924cfe-327d-d3ca-9576-9e3280a1b1a4.htm
---
# Autodesk.Revit.DB.SheetDuplicateOption.DuplicateSheetWithViewsAndDetailing

Duplicate the sheet. Copy its title block, details, viewports, and duplicate its contained views with detailing.
 The newly created sheet will reference the newly duplicated views.